---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.HadToAlignEaves
source: html/22f5fae5-1688-fb44-ef5e-8d4eed1f0fd3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.HadToAlignEaves Property

Adjacent slope-defining lines must have identical eave heights. Eaves were aligned to higher location automatically
 to avoid failure. Use the Align Eaves tool to specify desired location.

## Syntax (C#)
```csharp
public static FailureDefinitionId HadToAlignEaves { get; }
```